////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ■概要    経度(Longitude), 緯度(Latitude)
////////////////////////////////////////////////////////////////////////////////////////////////////////////
// GPS座標の相互変換(大別して以下の２通りがある)
// ・世界測地系と日本測地系
// ・ミリ秒表示と度表示
//
//      ・世界測地系 (GPSチップなどはこの方式,Googleマップなどもこの方式,ほぼ標準!!)
//      ・日本測地系 (SuperMappleなどはこの方式)
//
//      ・ミリ秒表示 (【503329984,128544000】というような小数点を含まない数字)
//      ・度表示     (度分秒の60進表記と10進表記がある)
//                     60進表記->【35度43分12.4378秒,139度45分10.4346秒】
//                     10進表記->【35.72012161,139.7528985】
////////////////////////////////////////////////////////////////////////////////////////////////////////////

namespace RealtimeViewer.Map
{
    public static class UtilGPSConvert
    {
        ////////////////////////////////////////////////////////////////////////////////////////////////////
        // 機能		: ミリ秒表示を10進の度表示へ変換する
        // 戻り値	: なし
        //--------------------------------------------------------------------------------------------------
        //------------型-----------	名称---------	[I/O]説明文	--------------------------------------------
        // 引数     : ref double    dLongitude      [I O]変換したいミリ秒表示の経度 ->10進の度表示に変換
        //          : ref double    dLatitude       [I O]変換したいミリ秒表示の緯度 ->10進の度表示に変換
        //--------------------------------------------------------------------------------------------------
        // 備考     : 【例】  503329984 -> 139.813884 (経度：Longitude)
        //          :         128544000 -> 35.706666  (緯度：Latitude)
        ////////////////////////////////////////////////////////////////////////////////////////////////////
        public static void Convert_Millisecond2Dgree10(ref double dLongitude, ref double dLatitude)
        {
            dLongitude = dLongitude / 3600000;
            dLatitude = dLatitude / 3600000;
        }
        public static void Convert_Dgree102Millisecond(ref double dLongitude, ref double dLatitude)
        {
            dLongitude = dLongitude * 3600000;
            dLatitude = dLatitude * 3600000;
        }
        public static long ToGPSMS(int dVal)
        {
            long a = dVal / 10000;
            long b = dVal % 10000;

            //
            long d = a / 100;
            long h = a % 100;

            b *= 60;
            b /= 100;

            long l;

            l = d * 3600000;
            l += h * 60000;
            l += b * 10;
            return l;
        }

        ////////////////////////////////////////////////////////////////////////////////////////////////////
        // 機能		: 10進の1000000倍表示を10進の度表示へ変換する
        // 戻り値	: なし
        //--------------------------------------------------------------------------------------------------
        //------------型-----------	名称---------	[I/O]説明文	--------------------------------------------
        // 引数     : ref double    dLongitude      [I O]変換したい10進の1000000倍表示の経度 ->10進の度表示に変換
        //          : ref double    dLatitude       [I O]変換したい10進の1000000倍表示の緯度 ->10進の度表示に変換
        //--------------------------------------------------------------------------------------------------
        // 備考     : 【例】  139813884 -> 139.813884 (経度：Longitude)
        //          :         35706666  -> 35.706666  (緯度：Latitude)
        ////////////////////////////////////////////////////////////////////////////////////////////////////
        public static void Convert_Dgree10INT2Dgree10(ref double dLongitude, ref double dLatitude)
        {
            dLongitude = dLongitude / 1000000;
            dLatitude = dLatitude / 1000000;
        }
    }
}
